{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. cd "E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2023\HRS_MANUSCRIPT_CHRIS\FINAL_DATA"
{res}E:\16GBBACKUPUSB\BACKUP_USB_SEPTEMBER2014\SUMMER_STUDENT_2023\HRS_MANUSCRIPT_CHRIS\FINAL_DATA
{txt}
{com}. 
. 
. 
. *****STEP -1: foodinsecurity DATA, 2013: MERGE AND CREATE THE foodinsecurity VARIABLE**
. 
. 
. ***2013***
. 
. **              storage   display    value
. **variable name   type    format     label      variable label
. **--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
. **HNB1_13         byte    %8.0g                 FOOD DID NOT LAST
. **HNB2_13         byte    %8.0g                 CANT AFFORD BALANCED MEALS
. **HNB3_13         byte    %8.0g                 CUT OR SKIP MEALS
. **HNB4_13         byte    %8.0g                 EAT LESS NOT ENOUGH MONEY
. **HNB5_13         byte    %8.0g                 GO HUNGRY NOT ENOUGH MONEY
. 
. 
. 
. use DATA_HCNS,clear
{txt}
{com}. destring HHID, replace
{txt}HHID: all characters numeric; {res}replaced {txt}as {res}long
{txt}
{com}. destring PN, replace
{txt}PN: all characters numeric; {res}replaced {txt}as {res}byte
{txt}
{com}. 
. capture drop HHIDPN
{txt}
{com}. egen HHIDPN = concat(HHID PN)
{txt}
{com}. 
. destring HHIDPN, replace
{txt}HHIDPN: all characters numeric; {res}replaced {txt}as {res}long
{txt}
{com}. sort HHIDPN
{txt}
{com}. 
. save DATA_HCNSfin, replace
{txt}{p 0 4 2}
file {bf}
DATA_HCNSfin.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. keep HHIDPN HNB1_13 HNB2_13  HNB3_13 HNB4_13 HNB19_13 HNB5_13 
{txt}
{com}. save foodinsecurity_data2013, replace
{txt}{p 0 4 2}
file {bf}
foodinsecurity_data2013.dta{rm}
saved
{p_end}

{com}. 
. use foodinsecurity_data2013,clear
{txt}
{com}. 
. tab1 HNB1_13 HNB2_13  HNB3_13 HNB4_13 HNB19_13 HNB5_13 

{res}-> tabulation of HNB1_13  

   {txt}FOOD DID {c |}
   NOT LAST {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        373        4.62        4.62
{txt}          2 {c |}{res}      1,324       16.40       21.02
{txt}          3 {c |}{res}      6,213       76.96       97.98
{txt}         99 {c |}{res}        163        2.02      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      8,073      100.00

-> tabulation of HNB2_13  

{txt}CANT AFFORD {c |}
   BALANCED {c |}
      MEALS {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        332        4.11        4.11
{txt}          2 {c |}{res}      1,235       15.30       19.41
{txt}          3 {c |}{res}      6,077       75.28       94.69
{txt}         99 {c |}{res}        429        5.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      8,073      100.00

-> tabulation of HNB3_13  

{txt}CUT OR SKIP {c |}
      MEALS {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        276        3.42        3.42
{txt}          2 {c |}{res}        561        6.95       10.37
{txt}          3 {c |}{res}        239        2.96       13.33
{txt}          5 {c |}{res}      6,934       85.89       99.22
{txt}         99 {c |}{res}         63        0.78      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      8,073      100.00

-> tabulation of HNB4_13  

   {txt}EAT LESS {c |}
 NOT ENOUGH {c |}
      MONEY {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        872       10.80       10.80
{txt}          5 {c |}{res}      7,142       88.47       99.27
{txt}         99 {c |}{res}         59        0.73      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      8,073      100.00

-> tabulation of HNB19_13  

{txt}AMOUNT LESS {c |}
   FOR FOOD {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}        654       20.20       20.20
{txt}          1 {c |}{res}          7        0.22       20.42
{txt}          2 {c |}{res}          1        0.03       20.45
{txt}          5 {c |}{res}         34        1.05       21.50
{txt}          7 {c |}{res}          4        0.12       21.62
{txt}          8 {c |}{res}          3        0.09       21.72
{txt}          9 {c |}{res}          3        0.09       21.81
{txt}         10 {c |}{res}        183        5.65       27.46
{txt}         11 {c |}{res}          1        0.03       27.49
{txt}         12 {c |}{res}          8        0.25       27.74
{txt}         15 {c |}{res}         65        2.01       29.75
{txt}         16 {c |}{res}          3        0.09       29.84
{txt}         18 {c |}{res}          3        0.09       29.94
{txt}         20 {c |}{res}        327       10.10       40.04
{txt}         21 {c |}{res}          1        0.03       40.07
{txt}         22 {c |}{res}          1        0.03       40.10
{txt}         24 {c |}{res}          2        0.06       40.16
{txt}         25 {c |}{res}        169        5.22       45.38
{txt}         26 {c |}{res}          2        0.06       45.44
{txt}         28 {c |}{res}          3        0.09       45.54
{txt}         29 {c |}{res}          1        0.03       45.57
{txt}         30 {c |}{res}        188        5.81       51.37
{txt}         35 {c |}{res}         22        0.68       52.05
{txt}         40 {c |}{res}        144        4.45       56.50
{txt}         45 {c |}{res}         16        0.49       57.00
{txt}         48 {c |}{res}          2        0.06       57.06
{txt}         50 {c |}{res}        437       13.50       70.56
{txt}         55 {c |}{res}          5        0.15       70.71
{txt}         56 {c |}{res}          1        0.03       70.74
{txt}         60 {c |}{res}         52        1.61       72.35
{txt}         65 {c |}{res}          7        0.22       72.57
{txt}         66 {c |}{res}          2        0.06       72.63
{txt}         70 {c |}{res}         32        0.99       73.62
{txt}         71 {c |}{res}          1        0.03       73.65
{txt}         73 {c |}{res}          1        0.03       73.68
{txt}         75 {c |}{res}         96        2.97       76.65
{txt}         79 {c |}{res}          1        0.03       76.68
{txt}         80 {c |}{res}         39        1.20       77.88
{txt}         84 {c |}{res}          1        0.03       77.91
{txt}         85 {c |}{res}          4        0.12       78.04
{txt}         90 {c |}{res}         12        0.37       78.41
{txt}        100 {c |}{res}        240        7.41       85.82
{txt}        104 {c |}{res}          1        0.03       85.85
{txt}        106 {c |}{res}          1        0.03       85.88
{txt}        110 {c |}{res}          4        0.12       86.01
{txt}        120 {c |}{res}          8        0.25       86.25
{txt}        122 {c |}{res}          1        0.03       86.28
{txt}        125 {c |}{res}          6        0.19       86.47
{txt}        130 {c |}{res}          2        0.06       86.53
{txt}        135 {c |}{res}          1        0.03       86.56
{txt}        140 {c |}{res}          4        0.12       86.69
{txt}        145 {c |}{res}          2        0.06       86.75
{txt}        150 {c |}{res}         38        1.17       87.92
{txt}        155 {c |}{res}          3        0.09       88.01
{txt}        160 {c |}{res}          2        0.06       88.08
{txt}        167 {c |}{res}          1        0.03       88.11
{txt}        175 {c |}{res}          6        0.19       88.29
{txt}        180 {c |}{res}          1        0.03       88.32
{txt}        190 {c |}{res}          1        0.03       88.35
{txt}        200 {c |}{res}         74        2.29       90.64
{txt}        225 {c |}{res}          2        0.06       90.70
{txt}        230 {c |}{res}          1        0.03       90.73
{txt}        250 {c |}{res}         10        0.31       91.04
{txt}        260 {c |}{res}          3        0.09       91.13
{txt}        275 {c |}{res}          1        0.03       91.16
{txt}        300 {c |}{res}         21        0.65       91.81
{txt}        342 {c |}{res}          1        0.03       91.84
{txt}        350 {c |}{res}          2        0.06       91.91
{txt}        375 {c |}{res}          2        0.06       91.97
{txt}        400 {c |}{res}         12        0.37       92.34
{txt}        450 {c |}{res}          1        0.03       92.37
{txt}        500 {c |}{res}          2        0.06       92.43
{txt}        600 {c |}{res}          1        0.03       92.46
{txt}        800 {c |}{res}          1        0.03       92.49
{txt}        916 {c |}{res}          1        0.03       92.52
{txt}       1000 {c |}{res}          2        0.06       92.59
{txt}       1100 {c |}{res}          1        0.03       92.62
{txt}       1500 {c |}{res}          1        0.03       92.65
{txt}       1981 {c |}{res}          1        0.03       92.68
{txt}       2000 {c |}{res}          4        0.12       92.80
{txt}       2390 {c |}{res}          1        0.03       92.83
{txt}       2500 {c |}{res}          2        0.06       92.89
{txt}       3000 {c |}{res}          1        0.03       92.93
{txt}       4000 {c |}{res}          2        0.06       92.99
{txt}       5000 {c |}{res}          2        0.06       93.05
{txt}       5321 {c |}{res}          1        0.03       93.08
{txt}       6000 {c |}{res}          1        0.03       93.11
{txt}       6566 {c |}{res}          1        0.03       93.14
{txt}       9800 {c |}{res}          1        0.03       93.17
{txt}      99999 {c |}{res}        221        6.83      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      3,237      100.00

-> tabulation of HNB5_13  

  {txt}GO HUNGRY {c |}
 NOT ENOUGH {c |}
      MONEY {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        524        6.49        6.49
{txt}          5 {c |}{res}      7,489       92.77       99.26
{txt}         99 {c |}{res}         60        0.74      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      8,073      100.00
{txt}
{com}. 
. save foodinsecurity_data2013, replace
{txt}{p 0 4 2}
file {bf}
foodinsecurity_data2013.dta{rm}
saved
{p_end}

{com}. 
. 
. **Source: https://www.ers.usda.gov/media/8282/short2012.pdf
. 
. 
. **This is what it says
. **i.    Responses of “often” or “sometimes” on questions HH3 and HH4, and “yes” on AD1, AD2, and AD3 are coded as affirmative (yes). Responses of “almost every month” and “some months but not every month” on AD1a are coded as affirmative (yes). 
. **Note, there is one question that you did not mention that has a skip pattern: (a) “How often did this happen—almost every month, some months but not every month, or in only 1 or 2 months?” which relies on an affirmative response to (b) “In the **last 12 months, since last (name of current month), did (you/you or other adults in your household) ever cut the size of your meals or skip meals because there wasn't enough money for food?”
. 
. **So the algorithm/logic would be as follows:
. **1.    Convert all character string variable to numeric (1 or 0) based on the above description in (i) for the 6 questions
. **2.    If there is an NA or missing value for the skip pattern question for those that responded “No” to question (b) above, it should be converted to 0.
. **3.    Take the sum of the six questions
. **4.    If sum >= 2, 1, else 0
. 
. tab1 HNB1_13 HNB2_13 HNB3_13 HNB4_13 HNB5_13

{res}-> tabulation of HNB1_13  

   {txt}FOOD DID {c |}
   NOT LAST {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        373        4.62        4.62
{txt}          2 {c |}{res}      1,324       16.40       21.02
{txt}          3 {c |}{res}      6,213       76.96       97.98
{txt}         99 {c |}{res}        163        2.02      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      8,073      100.00

-> tabulation of HNB2_13  

{txt}CANT AFFORD {c |}
   BALANCED {c |}
      MEALS {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        332        4.11        4.11
{txt}          2 {c |}{res}      1,235       15.30       19.41
{txt}          3 {c |}{res}      6,077       75.28       94.69
{txt}         99 {c |}{res}        429        5.31      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      8,073      100.00

-> tabulation of HNB3_13  

{txt}CUT OR SKIP {c |}
      MEALS {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        276        3.42        3.42
{txt}          2 {c |}{res}        561        6.95       10.37
{txt}          3 {c |}{res}        239        2.96       13.33
{txt}          5 {c |}{res}      6,934       85.89       99.22
{txt}         99 {c |}{res}         63        0.78      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      8,073      100.00

-> tabulation of HNB4_13  

   {txt}EAT LESS {c |}
 NOT ENOUGH {c |}
      MONEY {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        872       10.80       10.80
{txt}          5 {c |}{res}      7,142       88.47       99.27
{txt}         99 {c |}{res}         59        0.73      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      8,073      100.00

-> tabulation of HNB5_13  

  {txt}GO HUNGRY {c |}
 NOT ENOUGH {c |}
      MONEY {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}        524        6.49        6.49
{txt}          5 {c |}{res}      7,489       92.77       99.26
{txt}         99 {c |}{res}         60        0.74      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      8,073      100.00
{txt}
{com}. 
. capture drop HNB1_13r
{txt}
{com}. gen HNB1_13r=.
{txt}(8,073 missing values generated)

{com}. replace HNB1_13r=HNB1_13
{txt}(8,073 real changes made)

{com}. replace HNB1_13r=. if HNB1_13==99
{txt}(163 real changes made, 163 to missing)

{com}. replace HNB1_13r=4 if HNB1_13==3
{txt}(6,213 real changes made)

{com}. 
. 
. capture drop HNB2_13r
{txt}
{com}. gen HNB2_13r=.
{txt}(8,073 missing values generated)

{com}. replace HNB2_13r=HNB2_13
{txt}(8,073 real changes made)

{com}. replace HNB2_13r=. if HNB2_13==99
{txt}(429 real changes made, 429 to missing)

{com}. replace HNB2_13r=4 if HNB2_13==3
{txt}(6,077 real changes made)

{com}. 
. 
. capture drop HNB3_13r
{txt}
{com}. gen  HNB3_13r=.
{txt}(8,073 missing values generated)

{com}. replace HNB3_13r=HNB3_13
{txt}(8,073 real changes made)

{com}. replace HNB3_13r=4 if HNB3_13==3
{txt}(239 real changes made)

{com}. replace HNB3_13r=. if HNB3_13==99
{txt}(63 real changes made, 63 to missing)

{com}. 
. 
. 
. capture drop HNB4_13r
{txt}
{com}. gen HNB4_13r=.
{txt}(8,073 missing values generated)

{com}. replace HNB4_13r=HNB4_13
{txt}(8,073 real changes made)

{com}. replace HNB4_13r=. if HNB4_13==99
{txt}(59 real changes made, 59 to missing)

{com}. 
. 
. capture drop HNB5_13r
{txt}
{com}. gen HNB5_13r=.
{txt}(8,073 missing values generated)

{com}. replace HNB5_13r=HNB5_13
{txt}(8,073 real changes made)

{com}. replace HNB5_13r=. if HNB5_13==99
{txt}(60 real changes made, 60 to missing)

{com}. 
. 
. capture drop foodinsecuritymiss
{txt}
{com}. egen  foodinsecuritymiss=rowmiss(HNB1_13r HNB2_13r HNB3_13r HNB3_13r HNB4_13r HNB5_13r)
{txt}
{com}. 
. capture drop foodinsecurity_tot
{txt}
{com}. egen foodinsecurity_tot=anycount(HNB1_13r HNB2_13r HNB3_13r HNB3_13r HNB4_13r HNB5_13r), values(1 2 3)
{txt}
{com}. replace foodinsecurity_tot=. if foodinsecuritymiss>0 
{txt}(507 real changes made, 507 to missing)

{com}. 
. tab foodinsecurity_tot

   {txt}HNB1_13r {c |}
   HNB2_13r {c |}
   HNB3_13r {c |}
   HNB3_13r {c |}
   HNB4_13r {c |}
HNB5_13r == {c |}
      1 2 3 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          0 {c |}{res}      5,687       75.17       75.17
{txt}          1 {c |}{res}        520        6.87       82.04
{txt}          2 {c |}{res}        466        6.16       88.20
{txt}          3 {c |}{res}        139        1.84       90.03
{txt}          4 {c |}{res}        181        2.39       92.43
{txt}          5 {c |}{res}        196        2.59       95.02
{txt}          6 {c |}{res}        377        4.98      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      7,566      100.00
{txt}
{com}. 
. capture drop foodinsecurity_totbr
{txt}
{com}. gen foodinsecurity_totbr=.
{txt}(8,073 missing values generated)

{com}. replace foodinsecurity_totbr=1 if foodinsecurity_tot>=2
{txt}(1,866 real changes made)

{com}. replace foodinsecurity_totbr=0 if foodinsecurity_tot<2 & foodinsecurity_tot~=.
{txt}(6,207 real changes made)

{com}. 
. sort HHIDPN
{txt}
{com}. 
. 
. 
. save, replace
{txt}{p 0 4 2}
file {bf}
foodinsecurity_data2013.dta{rm}
saved
{p_end}

{com}. 
. 
. *********************************************************************************************************************************************
. 
. capture log close
{smcl}
{com}{sf}{ul off}