{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. use FIGURE3A_DEMENTIA_TE,clear
{txt}
{com}. 
. ************************************FIGURE 3*****************************************************************
. 
. **1=Reduced
. **2=Reduced+Education
. **3=Reduced+Wealth/Income
. **4=Reduced+Marital Status
. **5=Reduced+Smoking Status
. **6=Reduced+Physical Activity
. **7=Reduced+Self-Rated Health 2010
. **8=Reduced+BMIBR 2010
. **9=Reduced+cardiometcondbr_2010
. **10=Reduced+zcesd_2010
. 
. 
. capture label drop MODELlab
{txt}
{com}. label define MODELlab 1 "Reduced" 2 "Reduced+Education" 3 "Reduced+Wealth/Income" 4 "Reduced+Marital Status" 5 "Reduced+Smoking Status" 6 "Reduced+Physical Activity" 7 "Reduced+Self-Rated Health 2010" 8 "Reduced+BMIBR 2010" 9 "Reduced+cardiometcondbr_2010" 10 "Reduced+zcesd_2010" 
{txt}
{com}. 
. capture drop algorithm_num
{txt}
{com}. gen algorithm_num=.
{txt}(30 missing values generated)

{com}. replace algorithm_num=1 if algorithm=="Hurd"
{txt}(10 real changes made)

{com}. replace algorithm_num=2 if algorithm=="Expert"
{txt}(10 real changes made)

{com}. replace algorithm_num=3 if algorithm=="LASSO"
{txt}(10 real changes made)

{com}. 
. capture drop ID
{txt}
{com}. gen ID=.
{txt}(30 missing values generated)

{com}. replace ID=algorithm_num*100+model_num
{txt}(30 real changes made)

{com}. 
. **Hurd algorithm**
. 
. twoway rcap te_lcl      te_ucl model_num if algorithm_num==1,  title("TE") ytitle(TE OF DEMENTIA) xtitle("Model/Hurd") xlab(1 "Reduced" 2 "Reduced+Education" 3 "Reduced+Wealth/Income" 4 "Reduced+Marital Status" 5 "Reduced+Smoking Status" 6 "Reduced+Physical Activity" 7 "Reduced+Self-Rated Health 2010" 8 "Reduced+BMIBR 2010" 9 "Reduced+cardiometcondbr_2010" 10 "Reduced+zcesd_2010", angle(90))  || scatter te_estimate model_num if algorithm_num==1 
{res}{txt}
{com}. 
. graph save FIGURE3A1_DEMENTIAHURD.gph,replace
{res}{txt}file {bf:FIGURE3A1_DEMENTIAHURD.gph} saved

{com}. 
. 
. 
. **Expert**
. twoway rcap te_lcl      te_ucl model_num if algorithm_num==2, title("TE") ytitle(TE OF DEMENTIA) xtitle("Model/Expert") xlab(1 "Reduced" 2 "Reduced+Education" 3 "Reduced+Wealth/Income" 4 "Reduced+Marital Status" 5 "Reduced+Smoking Status" 6 "Reduced+Physical Activity" 7 "Reduced+Self-Rated Health 2010" 8 "Reduced+BMIBR 2010" 9 "Reduced+cardiometcondbr_2010" 10 "Reduced+zcesd_2010", angle(90))  || scatter te_estimate model_num if algorithm_num==2 
{res}{txt}
{com}. 
. graph save FIGURE3A2_DEMENTIAEXPERT.gph,replace
{res}{txt}file {bf:FIGURE3A2_DEMENTIAEXPERT.gph} saved

{com}. 
. 
. **LASSO**
. twoway rcap te_lcl      te_ucl model_num if algorithm_num==3, title("TE") ytitle(TE OF DEMENTIA) xtitle("Model/LASSO") xlab(1 "Reduced" 2 "Reduced+Education" 3 "Reduced+Wealth/Income" 4 "Reduced+Marital Status" 5 "Reduced+Smoking Status" 6 "Reduced+Physical Activity" 7 "Reduced+Self-Rated Health 2010" 8 "Reduced+BMIBR 2010" 9 "Reduced+cardiometcondbr_2010" 10 "Reduced+zcesd_2010", angle(90))  || scatter te_estimate model_num if algorithm_num==3
{res}{txt}
{com}. 
. graph save FIGURE3A3_DEMENTIALASSO.gph,replace
{res}{txt}file {bf:FIGURE3A3_DEMENTIALASSO.gph} saved

{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
FIGURE3A_DEMENTIA_TE.dta{rm}
saved
{p_end}

{com}. 
. 
. ***********************TOTAL EFFECT OF LONELINESS****************************
. 
. use FIGURE3B_LONELINESS_TE,clear
{txt}
{com}. 
. 
. **Hurd algorithm**
. 
. twoway rcap te_lcl      te_ucl model_num if algorithm_num==1,  title("TE") ytitle(TE OF LONELINESS) xtitle("Model/Hurd") xlab(1 "Reduced" 2 "Reduced+Education" 3 "Reduced+Wealth/Income" 4 "Reduced+Marital Status" 5 "Reduced+Smoking Status" 6 "Reduced+Physical Activity" 7 "Reduced+Self-Rated Health 2010" 8 "Reduced+BMIBR 2010" 9 "Reduced+cardiometcondbr_2010" 10 "Reduced+zcesd_2010", angle(90))  || scatter te_estimate model_num if algorithm_num==1 
{res}{txt}
{com}. 
. graph save FIGURE3A1_LONELINESSHURD.gph,replace
{res}{txt}file {bf:FIGURE3A1_LONELINESSHURD.gph} saved

{com}. 
. 
. **Expert**
. twoway rcap te_lcl      te_ucl model_num if algorithm_num==2, title("TE") ytitle(TE OF LONELINESS) xtitle("Model/Expert") xlab(1 "Reduced" 2 "Reduced+Education" 3 "Reduced+Wealth/Income" 4 "Reduced+Marital Status" 5 "Reduced+Smoking Status" 6 "Reduced+Physical Activity" 7 "Reduced+Self-Rated Health 2010" 8 "Reduced+BMIBR 2010" 9 "Reduced+cardiometcondbr_2010" 10 "Reduced+zcesd_2010", angle(90))  || scatter te_estimate model_num if algorithm_num==2 
{res}{txt}
{com}. 
. graph save FIGURE3A2_LONELINESSEXPERT.gph,replace
{res}{txt}file {bf:FIGURE3A2_LONELINESSEXPERT.gph} saved

{com}. 
. 
. **LASSO**
. twoway rcap te_lcl      te_ucl model_num if algorithm_num==3, title("TE") ytitle(TE OF LONELINESS) xtitle("Model/LASSO") xlab(1 "Reduced" 2 "Reduced+Education" 3 "Reduced+Wealth/Income" 4 "Reduced+Marital Status" 5 "Reduced+Smoking Status" 6 "Reduced+Physical Activity" 7 "Reduced+Self-Rated Health 2010" 8 "Reduced+BMIBR 2010" 9 "Reduced+cardiometcondbr_2010" 10 "Reduced+zcesd_2010", angle(90))  || scatter te_estimate model_num if algorithm_num==3
{res}{txt}
{com}. 
. graph save FIGURE3A3_LONELINESSLASSO.gph,replace
{res}{txt}file {bf:FIGURE3A3_LONELINESSLASSO.gph} saved

{com}. 
{txt}end of do-file

{com}. do "C:\Users\baydounm\AppData\Local\Temp\STD6cd0_000000.tmp"
{txt}
{com}. capture log close
{smcl}
{com}{sf}{ul off}