{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. use finaldata_imputed_FINAL,clear
{txt}
{com}. 
. 
. **STEP 14: FIGURE 2: COMPARE SURVIVAL PROBABILITIES ACROSS EXPOSURE (foodinsecurity_tot, create tertiles) AND MEDIATOR LEVELS (hurd_dem expert_dem lasso_dem)**
. 
. mi extract 0
{txt}
{com}. 
. save finaldata_unimputed_FINAL, replace
{txt}{p 0 4 2}
file {bf}
finaldata_unimputed_FINAL.dta{rm}
saved
{p_end}

{com}. 
. 
. stset ageevent if sample_final==1, failure(died==1) enter(AGE2012) origin(AGE2012) scale(1)

{txt}Survival-time data settings

{col 10}Failure event: {res}died==1
{col 1}{txt}Observed time interval: {res}(origin, ageevent]
{col 6}{txt}Enter on or after: {res}time AGE2012
{col 6}{txt}Exit on or before: {res}failure
{col 6}{txt}Time for analysis: {res}(time-origin)
{col 17}{txt}Origin: {res}time AGE2012
{col 7}{txt}Keep observations 
{col 17}{help j_st_ifvsoptif:{bf:if} {it:exp}}: {res}sample_final==1

{txt}{hline 74}
{res}     43,382{txt}  total observations
{res}     40,488{txt}  ignored at outset because of {bf:if} {it:exp}
{res}          7{txt}  event time missing (ageevent>=.){col 61}PROBABLE ERROR
{hline 74}
{res}      2,887{txt}  observations remaining, representing
{res}        895{txt}  failures in single-record/single-failure data
{res} 22,808.974{txt}  total analysis time at risk and under observation
                                                At risk from t = {res}        0
                                     {txt}Earliest observed entry t = {res}        0
                                          {txt}Last observed exit t = {res} 9.580025
{txt}
{com}. 
. 
. stdescribe if sample_final==1

{col 10}{txt}Failure {bf:_d}: {res}died==1
{col 4}{txt}Analysis time {bf:_t}: {res}(ageevent-origin)
{col 14}{txt}Origin: {res}time AGE2012
{col 3}{txt}Enter on or after: {res}time AGE2012

{txt}{col 36}{c LT}{hline 14} Per subject {hline 14}{c RT}
Category{col 28}Total{col 41}Mean{col 54}Min{col 62}Median{col 76}Max
{hline 78}
Number of subjects    {res}      2887   
{txt}Number of records     {res}      2887           1           1          1          1

{txt}Entry time (first)                 {res}        0           0          0          0
{txt}Exit time (final)                  {res}  7.90058    1.849518   8.658005   9.580025

{txt}Subjects with gap     {res}         0   
{txt}Time on gap           {res}         0   
{txt}Time at risk          {res} 22808.974     7.90058    1.849518   8.658005   9.580025

{txt}Failures              {res}       895    .3100104           0          0          1
{txt}{hline 78}

{com}. stsum if sample_final==1

{col 10}{txt}Failure {bf:_d}: {res}died==1
{col 4}{txt}Analysis time {bf:_t}: {res}(ageevent-origin)
{col 14}{txt}Origin: {res}time AGE2012
{col 3}{txt}Enter on or after: {res}time AGE2012

{txt}{col 10}{c |}{col 26}Incidence{col 40}Number of{col 52}{c LT}{hline 6} Survival time {hline 5}{c RT}
        {col 10}{c |} Time at risk{col 31}rate{col 41}subjects{col 57}25%{col 67}50%{col 77}75%
{hline 9}{c +}{hline 69}
   Total {c |} {res}  22,808.974   .0392389{col 40}     2887   7.611488         .         .
{txt}
{com}. strate if sample_final==1

{col 10}{txt}Failure {bf:_d}: {res}died==1
{col 4}{txt}Analysis time {bf:_t}: {res}(ageevent-origin)
{col 14}{txt}Origin: {res}time AGE2012
{col 3}{txt}Enter on or after: {res}time AGE2012

{txt}Estimated failure rates
Number of records = {res}2887
{txt}
  {c TLC}{hline 5}{c -}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c TRC}
  {c |} {res}  D         Y       Rate      Lower      Upper {txt}{c |}
  {c LT}{hline 5}{c -}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c RT}
  {c |} {res}895   2.3e+04   0.039239   0.036751   0.041896 {txt}{c |}
  {c BLC}{hline 5}{c -}{hline 9}{c -}{hline 10}{c -}{hline 10}{c -}{hline 10}{c BRC}
   Notes: Rate = D/Y = failures/person-time.
          Lower and Upper are bounds of 95% confidence intervals.


{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_unimputed_FINAL.dta{rm}
saved
{p_end}

{com}. 
. 
. bysort foodinsecurity_totbr: su foodinsecurity_tot if sample_final==1,detail

{txt}{hline}
-> foodinsecurity_totbr = 0

        HNB1_13r HNB2_13r HNB3_13r HNB3_13r HNB4_13r
                      HNB5_13r == 1 2 3
{hline 61}
      Percentiles      Smallest
 1%    {res}        0              0
{txt} 5%    {res}        0              0
{txt}10%    {res}        0              0       {txt}Obs         {res}      2,611
{txt}25%    {res}        0              0       {txt}Sum of wgt. {res}      2,611

{txt}50%    {res}        0                      {txt}Mean          {res} .0559173
                        {txt}Largest       Std. dev.     {res} .2298059
{txt}75%    {res}        0              1
{txt}90%    {res}        0              1       {txt}Variance      {res} .0528108
{txt}95%    {res}        1              1       {txt}Skewness      {res} 3.865591
{txt}99%    {res}        1              1       {txt}Kurtosis      {res} 15.94279

{txt}{hline}
-> foodinsecurity_totbr = 1

        HNB1_13r HNB2_13r HNB3_13r HNB3_13r HNB4_13r
                      HNB5_13r == 1 2 3
{hline 61}
      Percentiles      Smallest
 1%    {res}        2              2
{txt} 5%    {res}        2              2
{txt}10%    {res}        2              2       {txt}Obs         {res}        283
{txt}25%    {res}        2              2       {txt}Sum of wgt. {res}        283

{txt}50%    {res}        3                      {txt}Mean          {res} 3.540636
                        {txt}Largest       Std. dev.     {res} 1.582577
{txt}75%    {res}        5              6
{txt}90%    {res}        6              6       {txt}Variance      {res} 2.504549
{txt}95%    {res}        6              6       {txt}Skewness      {res} .4201175
{txt}99%    {res}        6              6       {txt}Kurtosis      {res} 1.600128

{txt}{hline}
-> foodinsecurity_totbr = .

        HNB1_13r HNB2_13r HNB3_13r HNB3_13r HNB4_13r
                      HNB5_13r == 1 2 3
{hline 61}
no observations


{com}. 
. save, replace
{txt}{p 0 4 2}
file {bf}
finaldata_unimputed_FINAL.dta{rm}
saved
{p_end}

{com}. 
{txt}end of do-file

{com}. do "C:\Users\baydounm\AppData\Local\Temp\STDf14_000000.tmp"
{txt}
{com}. 
. sts test foodinsecurity_totbr if sample_final==1, logrank

{col 10}{txt}Failure {bf:_d}: {res}died==1
{col 4}{txt}Analysis time {bf:_t}: {res}(ageevent-origin)
{col 14}{txt}Origin: {res}time AGE2012
{col 3}{txt}Enter on or after: {res}time AGE2012
{err}{p 0 4 2}
file {bf:{err}C:\Users\baydounm\AppData\Local\Temp\ST_f14_000002.tmp}
already exists
{p_end}
{txt}{search r(602), local:r(602);}

end of do-file

{search r(602), local:r(602);}

{com}. do "C:\Users\baydounm\AppData\Local\Temp\STDf14_000000.tmp"
{txt}
{com}. 
. sts test foodinsecurity_totbr if sample_final==1, logrank

{col 10}{txt}Failure {bf:_d}: {res}died==1
{col 4}{txt}Analysis time {bf:_t}: {res}(ageevent-origin)
{col 14}{txt}Origin: {res}time AGE2012
{col 3}{txt}Enter on or after: {res}time AGE2012

{txt}Equality of survivor functions
Log-rank test

{col 13} {c |}  Observed       Expected
foodinsecu~r {c |}    events         events
{hline 13}{c +}{hline 25}
           0 {c |}{res}       821         802.83
           {txt}1 {c |}{res}        74          92.17
{txt}{hline 13}{c +}{hline 25}
       Total {c |}{res}       895         895.00

                       {txt}chi2(1) =   {res}3.99
                       {txt}Pr>chi2 = {res}0.0457
{txt}
{com}. sts graph if sample_final==1, by(foodinsecurity_totbr) 

{col 10}{txt}Failure {bf:_d}: {res}died==1
{col 4}{txt}Analysis time {bf:_t}: {res}(ageevent-origin)
{col 14}{txt}Origin: {res}time AGE2012
{col 3}{txt}Enter on or after: {res}time AGE2012
{txt}
{com}. 
. graph save "FIGURE2A.gph", replace
{res}{txt}file {bf:FIGURE2A.gph} saved

{com}. 
. sts test hurd_dem if sample_final==1, logrank

{col 10}{txt}Failure {bf:_d}: {res}died==1
{col 4}{txt}Analysis time {bf:_t}: {res}(ageevent-origin)
{col 14}{txt}Origin: {res}time AGE2012
{col 3}{txt}Enter on or after: {res}time AGE2012

{txt}Equality of survivor functions
Log-rank test

{col 9} {c |}  Observed       Expected
hurd_dem {c |}    events         events
{hline 9}{c +}{hline 25}
       0 {c |}{res}       659         817.43
       {txt}1 {c |}{res}       236          77.57
{txt}{hline 9}{c +}{hline 25}
   Total {c |}{res}       895         895.00

                   {txt}chi2(1) = {res}356.01
                   {txt}Pr>chi2 = {res}0.0000
{txt}
{com}. sts graph if sample_final==1, by(hurd_dem) 

{col 10}{txt}Failure {bf:_d}: {res}died==1
{col 4}{txt}Analysis time {bf:_t}: {res}(ageevent-origin)
{col 14}{txt}Origin: {res}time AGE2012
{col 3}{txt}Enter on or after: {res}time AGE2012
{txt}
{com}. 
. 
. graph save "FIGURE2B.gph", replace
{res}{txt}file {bf:FIGURE2B.gph} saved

{com}. 
. 
. sts test expert_dem if sample_final==1, logrank

{col 10}{txt}Failure {bf:_d}: {res}died==1
{col 4}{txt}Analysis time {bf:_t}: {res}(ageevent-origin)
{col 14}{txt}Origin: {res}time AGE2012
{col 3}{txt}Enter on or after: {res}time AGE2012

{txt}Equality of survivor functions
Log-rank test

{col 11} {c |}  Observed       Expected
expert_dem {c |}    events         events
{hline 11}{c +}{hline 25}
         0 {c |}{res}       627         810.68
         {txt}1 {c |}{res}       268          84.32
{txt}{hline 11}{c +}{hline 25}
     Total {c |}{res}       895         895.00

                     {txt}chi2(1) = {res}444.26
                     {txt}Pr>chi2 = {res}0.0000
{txt}
{com}. sts graph if sample_final==1, by(expert_dem) 

{col 10}{txt}Failure {bf:_d}: {res}died==1
{col 4}{txt}Analysis time {bf:_t}: {res}(ageevent-origin)
{col 14}{txt}Origin: {res}time AGE2012
{col 3}{txt}Enter on or after: {res}time AGE2012
{txt}
{com}. 
. 
. graph save "FIGURE2C.gph", replace
{res}{txt}file {bf:FIGURE2C.gph} saved

{com}. 
. 
. sts test lasso_dem if sample_final==1, logrank

{col 10}{txt}Failure {bf:_d}: {res}died==1
{col 4}{txt}Analysis time {bf:_t}: {res}(ageevent-origin)
{col 14}{txt}Origin: {res}time AGE2012
{col 3}{txt}Enter on or after: {res}time AGE2012

{txt}Equality of survivor functions
Log-rank test

{col 10} {c |}  Observed       Expected
lasso_dem {c |}    events         events
{hline 10}{c +}{hline 25}
        0 {c |}{res}       640         808.08
        {txt}1 {c |}{res}       255          86.92
{txt}{hline 10}{c +}{hline 25}
    Total {c |}{res}       895         895.00

                    {txt}chi2(1) = {res}361.75
                    {txt}Pr>chi2 = {res}0.0000
{txt}
{com}. sts graph if sample_final==1, by(lasso_dem) 

{col 10}{txt}Failure {bf:_d}: {res}died==1
{col 4}{txt}Analysis time {bf:_t}: {res}(ageevent-origin)
{col 14}{txt}Origin: {res}time AGE2012
{col 3}{txt}Enter on or after: {res}time AGE2012
{txt}
{com}. 
. 
. graph save "FIGURE2D.gph", replace
{res}{txt}file {bf:FIGURE2D.gph} saved

{com}. 
. graph combine "FIGURE2A.gph" "FIGURE2B.gph" "FIGURE2C.gph" "FIGURE2D.gph"
{res}{txt}
{com}. graph save "FIGURE2.gph", replace
{res}{txt}file {bf:FIGURE2.gph} saved

{com}. 
. capture log close
{smcl}
{com}{sf}{ul off}