{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. **STEP 18: TABLE 3: MED4WAY FOR foodinsecurity AS EXPOSURE, DIFFERENT PROBABILITIES OF DEMENTIA AS MEDIATORS, AND ALL-CAUSE DEATH AS OUTCOME: FULL MODEL; OVERALL AND STRATIFIED BY SEX AND BY RACE/ETHNICITY***
. 
. **COVARIATES: NonWhite AGE2012 SEX  i.education  i.totwealth_2012 marital_2012 work_st_2012 i.smoking_2012 i.alcohol_2012 physic_act_2012 i.srh_2012  i.bmibr_2012 cardiometcondbr_2012
. 
. use finaldata_imputed_FINAL,clear
{txt}
{com}. 
. 
. capture drop lnhurd_odds
{txt}
{com}. mi passive: gen lnhurd_odds=ln((hurd_p)/(1-hurd_p))
{res}{txt}{p}
(passive variable
{res}lnhurd_odds
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(35,574 missing values generated)
{it:m}=1:
(35,574 missing values generated)
{it:m}=2:
(35,574 missing values generated)
{it:m}=3:
(35,574 missing values generated)
{it:m}=4:
(35,574 missing values generated)
{it:m}=5:
(35,574 missing values generated)

{com}. 
. capture drop lnexpert_odds
{txt}
{com}. mi passive: gen lnexpert_odds=ln((expert_p)/(1-expert_p))
{res}{txt}{p}
(passive variable
{res}lnexpert_odds
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(35,573 missing values generated)
{it:m}=1:
(35,573 missing values generated)
{it:m}=2:
(35,573 missing values generated)
{it:m}=3:
(35,573 missing values generated)
{it:m}=4:
(35,573 missing values generated)
{it:m}=5:
(35,573 missing values generated)

{com}. 
. 
. capture drop lnlasso_odds
{txt}
{com}. mi passive: gen lnlasso_odds=ln((lasso_p)/(1-lasso_p))
{res}{txt}{p}
(passive variable
{res}lnlasso_odds
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(36,047 missing values generated)
{it:m}=1:
(36,047 missing values generated)
{it:m}=2:
(36,047 missing values generated)
{it:m}=3:
(36,047 missing values generated)
{it:m}=4:
(36,047 missing values generated)
{it:m}=5:
(36,047 missing values generated)

{com}. 
. 
. capture drop Men
{txt}
{com}. mi passive: gen Men=1 if SEX==1 & sample_final==1
{res}{txt}{p}
(passive variable
{res}Men
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(42,180 missing values generated)
{it:m}=1:
(42,180 missing values generated)
{it:m}=2:
(42,180 missing values generated)
{it:m}=3:
(42,180 missing values generated)
{it:m}=4:
(42,180 missing values generated)
{it:m}=5:
(42,180 missing values generated)

{com}. mi passive: replace Men=0 if Men~=1 & SEX~=. & sample_final==1
{res}{txt}{it:m}=0:
(1,692 real changes made)
{it:m}=1:
(1,692 real changes made)
{it:m}=2:
(1,692 real changes made)
{it:m}=3:
(1,692 real changes made)
{it:m}=4:
(1,692 real changes made)
{it:m}=5:
(1,692 real changes made)

{com}. 
. capture drop Women
{txt}
{com}. mi passive: gen Women=1 if SEX==2 & sample_final==1
{res}{txt}{p}
(passive variable
{res}Women
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(41,690 missing values generated)
{it:m}=1:
(41,690 missing values generated)
{it:m}=2:
(41,690 missing values generated)
{it:m}=3:
(41,690 missing values generated)
{it:m}=4:
(41,690 missing values generated)
{it:m}=5:
(41,690 missing values generated)

{com}. mi passive: replace Women=0 if Women~=1 & SEX~=. & sample_final==1
{res}{txt}{it:m}=0:
(1,202 real changes made)
{it:m}=1:
(1,202 real changes made)
{it:m}=2:
(1,202 real changes made)
{it:m}=3:
(1,202 real changes made)
{it:m}=4:
(1,202 real changes made)
{it:m}=5:
(1,202 real changes made)

{com}. 
. capture drop NHW
{txt}
{com}. mi passive: gen NHW=1 if RACE_ETHN==1 & sample_final==1
{res}{txt}{p}
(passive variable
{res}NHW
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(41,015 missing values generated)
{it:m}=1:
(41,015 missing values generated)
{it:m}=2:
(41,015 missing values generated)
{it:m}=3:
(41,015 missing values generated)
{it:m}=4:
(41,015 missing values generated)
{it:m}=5:
(41,015 missing values generated)

{com}. mi passive: replace NHW=0 if NHW~=1 & RACE_ETHN~=. & sample_final==1
{res}{txt}{it:m}=0:
(527 real changes made)
{it:m}=1:
(527 real changes made)
{it:m}=2:
(527 real changes made)
{it:m}=3:
(527 real changes made)
{it:m}=4:
(527 real changes made)
{it:m}=5:
(527 real changes made)

{com}. 
. capture drop NHB
{txt}
{com}. mi passive: gen NHB=1 if RACE_ETHN==2 & sample_final==1
{res}{txt}{p}
(passive variable
{res}NHB
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(43,049 missing values generated)
{it:m}=1:
(43,049 missing values generated)
{it:m}=2:
(43,049 missing values generated)
{it:m}=3:
(43,049 missing values generated)
{it:m}=4:
(43,049 missing values generated)
{it:m}=5:
(43,049 missing values generated)

{com}. mi passive: replace NHB=0 if NHB~=1 & RACE_ETHN~=. & sample_final==1
{res}{txt}{it:m}=0:
(2,561 real changes made)
{it:m}=1:
(2,561 real changes made)
{it:m}=2:
(2,561 real changes made)
{it:m}=3:
(2,561 real changes made)
{it:m}=4:
(2,561 real changes made)
{it:m}=5:
(2,561 real changes made)

{com}. 
. 
. capture drop HISP
{txt}
{com}. mi passive: gen HISP=1 if RACE_ETHN==3 & sample_final==1
{res}{txt}{p}
(passive variable
{res}HISP
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(43,188 missing values generated)
{it:m}=1:
(43,188 missing values generated)
{it:m}=2:
(43,188 missing values generated)
{it:m}=3:
(43,188 missing values generated)
{it:m}=4:
(43,188 missing values generated)
{it:m}=5:
(43,188 missing values generated)

{com}. mi passive: replace HISP=0 if HISP~=1 & RACE_ETHN~=. & sample_final==1 
{res}{txt}{it:m}=0:
(2,700 real changes made)
{it:m}=1:
(2,700 real changes made)
{it:m}=2:
(2,700 real changes made)
{it:m}=3:
(2,700 real changes made)
{it:m}=4:
(2,700 real changes made)
{it:m}=5:
(2,700 real changes made)

{com}. 
. 
. capture drop OTHER
{txt}
{com}. mi passive: gen OTHER=1 if RACE_ETHN==4 & sample_final==1
{res}{txt}{p}
(passive variable
{res}OTHER
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(43,382 missing values generated)
{it:m}=1:
(43,382 missing values generated)
{it:m}=2:
(43,382 missing values generated)
{it:m}=3:
(43,382 missing values generated)
{it:m}=4:
(43,382 missing values generated)
{it:m}=5:
(43,382 missing values generated)

{com}. mi passive: replace OTHER=0 if OTHER~=1 & RACE_ETHN~=. & sample_final==1
{res}{txt}{it:m}=0:
(2,894 real changes made)
{it:m}=1:
(2,894 real changes made)
{it:m}=2:
(2,894 real changes made)
{it:m}=3:
(2,894 real changes made)
{it:m}=4:
(2,894 real changes made)
{it:m}=5:
(2,894 real changes made)

{com}. 
. 
. capture drop NonWhite
{txt}
{com}. mi passive: gen NonWhite=0 if RACE_ETHN==1 & sample_final==1
{res}{txt}{p}
(passive variable
{res}NonWhite
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(41,015 missing values generated)
{it:m}=1:
(41,015 missing values generated)
{it:m}=2:
(41,015 missing values generated)
{it:m}=3:
(41,015 missing values generated)
{it:m}=4:
(41,015 missing values generated)
{it:m}=5:
(41,015 missing values generated)

{com}. mi passive: replace NonWhite=1 if RACE_ETHN!=1 & RACE_ETHN!=. & sample_final==1
{res}{txt}{it:m}=0:
(527 real changes made)
{it:m}=1:
(527 real changes made)
{it:m}=2:
(527 real changes made)
{it:m}=3:
(527 real changes made)
{it:m}=4:
(527 real changes made)
{it:m}=5:
(527 real changes made)

{com}. 
. save, replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_f14_000002.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_f14_000002.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. 
. 
. capture mi stset ageevent [pweight = HCNSWGTR_NT] if sample_final==1, failure(died==1) enter(AGE2012) origin(AGE2012) id(HHIDPN) scale(1)
{txt}
{com}. 
. 
. 
. ***************************TABLE S3: MODEL 1*********************************
. 
. *****************************OVERALL*******************************
. capture drop zlnhurd_odds zlnexpert_odds zlnlasso_odds 
{txt}
{com}. foreach x of varlist  lnhurd_odds lnexpert_odds lnlasso_odds {c -(}
{txt}  2{com}.         mi passive: egen z`x'=std(`x') if sample_final==1
{txt}  3{com}. {c )-}
{res}{txt}{p}
(passive variables
{res}zlnhurd_odds zlnexpert_odds zlnlasso_odds
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(40,488 missing values generated)
{it:m}=1:
(40,488 missing values generated)
{it:m}=2:
(40,488 missing values generated)
{it:m}=3:
(40,488 missing values generated)
{it:m}=4:
(40,488 missing values generated)
{it:m}=5:
(40,488 missing values generated)
{res}{txt}{it:m}=0:
(40,488 missing values generated)
{it:m}=1:
(40,488 missing values generated)
{it:m}=2:
(40,488 missing values generated)
{it:m}=3:
(40,488 missing values generated)
{it:m}=4:
(40,488 missing values generated)
{it:m}=5:
(40,488 missing values generated)
{res}{txt}{it:m}=0:
(40,488 missing values generated)
{it:m}=1:
(40,488 missing values generated)
{it:m}=2:
(40,488 missing values generated)
{it:m}=3:
(40,488 missing values generated)
{it:m}=4:
(40,488 missing values generated)
{it:m}=5:
(40,488 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_f14_000002.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_f14_000002.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way foodinsecurity_totbr `m' AGE2012 SEX NonWhite   if sample_final==1 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,894
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0086316{col 26}{space 2} .1270897{col 37}{space 1}    0.07{col 46}{space 3}0.946{col 54}{space 4}-.2404597{col 67}{space 3} .2577229
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0735966{col 26}{space 2} .1286216{col 37}{space 1}   -0.57{col 46}{space 3}0.567{col 54}{space 4}-.3256904{col 67}{space 3} .1784971
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0045597{col 26}{space 2} .0296594{col 37}{space 1}   -0.15{col 46}{space 3}0.878{col 54}{space 4}-.0626912{col 67}{space 3} .0535717
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0092382{col 26}{space 2} .0348195{col 37}{space 1}   -0.27{col 46}{space 3}0.791{col 54}{space 4}-.0774833{col 67}{space 3} .0590068
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0960262{col 26}{space 2} .0230727{col 37}{space 1}    4.16{col 46}{space 3}0.000{col 54}{space 4} .0508046{col 67}{space 3} .1412478
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,894
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0002974{col 26}{space 2} .1266384{col 37}{space 1}   -0.00{col 46}{space 3}0.998{col 54}{space 4}-.2485041{col 67}{space 3} .2479092
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0495089{col 26}{space 2} .1263808{col 37}{space 1}   -0.39{col 46}{space 3}0.695{col 54}{space 4}-.2972108{col 67}{space 3}  .198193
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0580853{col 26}{space 2} .0270736{col 37}{space 1}   -2.15{col 46}{space 3}0.032{col 54}{space 4}-.1111486{col 67}{space 3} -.005022
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0759352{col 26}{space 2} .0387374{col 37}{space 1}   -1.96{col 46}{space 3}0.050{col 54}{space 4}-.1518591{col 67}{space 3}-.0000114
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}  .183232{col 26}{space 2} .0389616{col 37}{space 1}    4.70{col 46}{space 3}0.000{col 54}{space 4} .1068686{col 67}{space 3} .2595954
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,894
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0049045{col 26}{space 2} .1260331{col 37}{space 1}   -0.04{col 46}{space 3}0.969{col 54}{space 4}-.2519248{col 67}{space 3} .2421158
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0715035{col 26}{space 2} .1231628{col 37}{space 1}   -0.58{col 46}{space 3}0.562{col 54}{space 4}-.3128982{col 67}{space 3} .1698911
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0330392{col 26}{space 2} .0284082{col 37}{space 1}   -1.16{col 46}{space 3}0.245{col 54}{space 4}-.0887183{col 67}{space 3} .0226399
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0400199{col 26}{space 2} .0324708{col 37}{space 1}   -1.23{col 46}{space 3}0.218{col 54}{space 4}-.1036615{col 67}{space 3} .0236218
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .1396581{col 26}{space 2} .0330891{col 37}{space 1}    4.22{col 46}{space 3}0.000{col 54}{space 4} .0748047{col 67}{space 3} .2045115
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. 
. *****************************MEN*******************************
. 
. 
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way foodinsecurity_totbr `m' AGE2012 SEX NonWhite   if SEX==1 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,202
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0140725{col 26}{space 2} .1944087{col 37}{space 1}    0.07{col 46}{space 3}0.942{col 54}{space 4}-.3669615{col 67}{space 3} .3951064
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0776685{col 26}{space 2} .2033576{col 37}{space 1}    0.38{col 46}{space 3}0.703{col 54}{space 4} -.320905{col 67}{space 3}  .476242
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.1004203{col 26}{space 2} .0350689{col 37}{space 1}   -2.86{col 46}{space 3}0.004{col 54}{space 4}-.1691541{col 67}{space 3}-.0316865
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0957716{col 26}{space 2} .0636373{col 37}{space 1}   -1.50{col 46}{space 3}0.132{col 54}{space 4}-.2204984{col 67}{space 3} .0289553
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .1325959{col 26}{space 2} .0564938{col 37}{space 1}    2.35{col 46}{space 3}0.019{col 54}{space 4} .0218701{col 67}{space 3} .2433216
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,202
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0026163{col 26}{space 2}  .193226{col 37}{space 1}    0.01{col 46}{space 3}0.989{col 54}{space 4}-.3760998{col 67}{space 3} .3813323
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0799281{col 26}{space 2} .1970599{col 37}{space 1}    0.41{col 46}{space 3}0.685{col 54}{space 4}-.3063023{col 67}{space 3} .4661585
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.1268232{col 26}{space 2} .0433891{col 37}{space 1}   -2.92{col 46}{space 3}0.003{col 54}{space 4}-.2118643{col 67}{space 3}-.0417821
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0956869{col 26}{space 2} .0629716{col 37}{space 1}   -1.52{col 46}{space 3}0.129{col 54}{space 4}-.2191089{col 67}{space 3} .0277351
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .1451982{col 26}{space 2} .0696898{col 37}{space 1}    2.08{col 46}{space 3}0.037{col 54}{space 4} .0086088{col 67}{space 3} .2817876
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,202
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0002815{col 26}{space 2} .1924097{col 37}{space 1}   -0.00{col 46}{space 3}0.999{col 54}{space 4}-.3773975{col 67}{space 3} .3768345
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} .0329357{col 26}{space 2} .1918049{col 37}{space 1}    0.17{col 46}{space 3}0.864{col 54}{space 4}-.3429951{col 67}{space 3} .4088665
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0799004{col 26}{space 2} .0319536{col 37}{space 1}   -2.50{col 46}{space 3}0.012{col 54}{space 4}-.1425283{col 67}{space 3}-.0172725
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0674796{col 26}{space 2} .0526098{col 37}{space 1}   -1.28{col 46}{space 3}0.200{col 54}{space 4}-.1705929{col 67}{space 3} .0356337
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .1141628{col 26}{space 2} .0613167{col 37}{space 1}    1.86{col 46}{space 3}0.063{col 54}{space 4}-.0060158{col 67}{space 3} .2343414
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. *****************************WOMEN*******************************
. 
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way foodinsecurity_totbr `m' AGE2012 SEX NonWhite   if SEX==2 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,692
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}  .000306{col 26}{space 2} .1679963{col 37}{space 1}    0.00{col 46}{space 3}0.999{col 54}{space 4}-.3289606{col 67}{space 3} .3295727
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.1569772{col 26}{space 2} .1622744{col 37}{space 1}   -0.97{col 46}{space 3}0.333{col 54}{space 4}-.4750291{col 67}{space 3} .1610746
{txt}ereri_intref {c |}{col 14}{res}{space 2} .0328017{col 26}{space 2} .0483142{col 37}{space 1}    0.68{col 46}{space 3}0.497{col 54}{space 4}-.0618923{col 67}{space 3} .1274958
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0301224{col 26}{space 2}  .049057{col 37}{space 1}    0.61{col 46}{space 3}0.539{col 54}{space 4}-.0660276{col 67}{space 3} .1262725
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0943591{col 26}{space 2} .0279223{col 37}{space 1}    3.38{col 46}{space 3}0.001{col 54}{space 4} .0396324{col 67}{space 3} .1490858
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,692
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0223796{col 26}{space 2} .1649128{col 37}{space 1}   -0.14{col 46}{space 3}0.892{col 54}{space 4}-.3456029{col 67}{space 3} .3008436
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.1402761{col 26}{space 2} .1620165{col 37}{space 1}   -0.87{col 46}{space 3}0.387{col 54}{space 4}-.4578227{col 67}{space 3} .1772705
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0246431{col 26}{space 2} .0335842{col 37}{space 1}   -0.73{col 46}{space 3}0.463{col 54}{space 4} -.090467{col 67}{space 3} .0411808
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0516847{col 26}{space 2} .0503054{col 37}{space 1}   -1.03{col 46}{space 3}0.304{col 54}{space 4}-.1502815{col 67}{space 3} .0469121
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .1942243{col 26}{space 2} .0470704{col 37}{space 1}    4.13{col 46}{space 3}0.000{col 54}{space 4}  .101968{col 67}{space 3} .2864806
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,692
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0262167{col 26}{space 2} .1641904{col 37}{space 1}   -0.16{col 46}{space 3}0.873{col 54}{space 4} -.348024{col 67}{space 3} .2955906
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.1588991{col 26}{space 2} .1573703{col 37}{space 1}   -1.01{col 46}{space 3}0.313{col 54}{space 4}-.4673393{col 67}{space 3}  .149541
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0016257{col 26}{space 2} .0403103{col 37}{space 1}   -0.04{col 46}{space 3}0.968{col 54}{space 4}-.0806324{col 67}{space 3}  .077381
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0127993{col 26}{space 2}  .044163{col 37}{space 1}   -0.29{col 46}{space 3}0.772{col 54}{space 4}-.0993572{col 67}{space 3} .0737586
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .1471074{col 26}{space 2} .0389924{col 37}{space 1}    3.77{col 46}{space 3}0.000{col 54}{space 4} .0706838{col 67}{space 3}  .223531
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. ***************************NHW*****************************************
. 
. 
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way foodinsecurity_totbr `m' AGE2012 SEX NonWhite   if NonWhite==0 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,367
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} .0155623{col 26}{space 2} .1581295{col 37}{space 1}    0.10{col 46}{space 3}0.922{col 54}{space 4}-.2943658{col 67}{space 3} .3254903
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0315133{col 26}{space 2} .1583935{col 37}{space 1}   -0.20{col 46}{space 3}0.842{col 54}{space 4}-.3419589{col 67}{space 3} .2789322
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0168118{col 26}{space 2} .0233378{col 37}{space 1}   -0.72{col 46}{space 3}0.471{col 54}{space 4} -.062553{col 67}{space 3} .0289294
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0296902{col 26}{space 2} .0465897{col 37}{space 1}   -0.64{col 46}{space 3}0.524{col 54}{space 4}-.1210044{col 67}{space 3}  .061624
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0935776{col 26}{space 2} .0287911{col 37}{space 1}    3.25{col 46}{space 3}0.001{col 54}{space 4} .0371481{col 67}{space 3} .1500071
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,367
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0006526{col 26}{space 2} .1561625{col 37}{space 1}   -0.00{col 46}{space 3}0.997{col 54}{space 4}-.3067255{col 67}{space 3} .3054202
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0328311{col 26}{space 2} .1549242{col 37}{space 1}   -0.21{col 46}{space 3}0.832{col 54}{space 4}-.3364769{col 67}{space 3} .2708148
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0606216{col 26}{space 2}  .021061{col 37}{space 1}   -2.88{col 46}{space 3}0.004{col 54}{space 4}-.1019003{col 67}{space 3}-.0193429
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.1186605{col 26}{space 2} .0578602{col 37}{space 1}   -2.05{col 46}{space 3}0.040{col 54}{space 4}-.2320645{col 67}{space 3}-.0052565
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .2114606{col 26}{space 2} .0500869{col 37}{space 1}    4.22{col 46}{space 3}0.000{col 54}{space 4}  .113292{col 67}{space 3} .3096291
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,367
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0042875{col 26}{space 2} .1556155{col 37}{space 1}   -0.03{col 46}{space 3}0.978{col 54}{space 4}-.3092882{col 67}{space 3} .3007133
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0376122{col 26}{space 2} .1521091{col 37}{space 1}   -0.25{col 46}{space 3}0.805{col 54}{space 4}-.3357406{col 67}{space 3} .2605162
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0450608{col 26}{space 2} .0251177{col 37}{space 1}   -1.79{col 46}{space 3}0.073{col 54}{space 4}-.0942907{col 67}{space 3}  .004169
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0620612{col 26}{space 2} .0438287{col 37}{space 1}   -1.42{col 46}{space 3}0.157{col 54}{space 4}-.1479638{col 67}{space 3} .0238415
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .1404467{col 26}{space 2} .0419306{col 37}{space 1}    3.35{col 46}{space 3}0.001{col 54}{space 4} .0582644{col 67}{space 3} .2226291
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. 
. ***************************Non-White*************************************
. 
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way foodinsecurity_totbr `m' AGE2012 SEX NonWhite   if NonWhite==1 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}       527
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0202393{col 26}{space 2} .2110623{col 37}{space 1}   -0.10{col 46}{space 3}0.924{col 54}{space 4}-.4339138{col 67}{space 3} .3934351
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.1506608{col 26}{space 2} .2004629{col 37}{space 1}   -0.75{col 46}{space 3}0.452{col 54}{space 4}-.5435609{col 67}{space 3} .2422392
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0010178{col 26}{space 2} .0848778{col 37}{space 1}   -0.01{col 46}{space 3}0.990{col 54}{space 4}-.1673754{col 67}{space 3} .1653397
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0054967{col 26}{space 2} .0594565{col 37}{space 1}   -0.09{col 46}{space 3}0.926{col 54}{space 4}-.1220293{col 67}{space 3} .1110359
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}  .136936{col 26}{space 2} .0554902{col 37}{space 1}    2.47{col 46}{space 3}0.014{col 54}{space 4} .0281772{col 67}{space 3} .2456949
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}       527
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0302158{col 26}{space 2} .2102513{col 37}{space 1}   -0.14{col 46}{space 3}0.886{col 54}{space 4}-.4423007{col 67}{space 3} .3818692
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.1143018{col 26}{space 2} .1956384{col 37}{space 1}   -0.58{col 46}{space 3}0.559{col 54}{space 4}-.4977461{col 67}{space 3} .2691425
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0318224{col 26}{space 2} .0986812{col 37}{space 1}   -0.32{col 46}{space 3}0.747{col 54}{space 4}-.2252341{col 67}{space 3} .1615893
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0200478{col 26}{space 2}  .051105{col 37}{space 1}   -0.39{col 46}{space 3}0.695{col 54}{space 4}-.1202118{col 67}{space 3} .0801161
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .1359562{col 26}{space 2} .0657175{col 37}{space 1}    2.07{col 46}{space 3}0.039{col 54}{space 4} .0071524{col 67}{space 3} .2647601
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}       527
{txt}{col 49}Average RVI{col 67}= {res}    0.0000
{txt}{col 49}Largest FMI{col 67}= {res}    0.0000
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}{help mi_missingdf##|_new:DF}:     min{col 67}= {res}         .
{txt}{col 49}        avg{col 67}= {res}         .
{txt}{col 49}        max{col 67}= {res}         .

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.0295689{col 26}{space 2} .2102898{col 37}{space 1}   -0.14{col 46}{space 3}0.888{col 54}{space 4}-.4417292{col 67}{space 3} .3825915
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.1752721{col 26}{space 2} .1921818{col 37}{space 1}   -0.91{col 46}{space 3}0.362{col 54}{space 4}-.5519416{col 67}{space 3} .2013973
{txt}ereri_intref {c |}{col 14}{res}{space 2} .0080847{col 26}{space 2} .0803704{col 37}{space 1}    0.10{col 46}{space 3}0.920{col 54}{space 4}-.1494384{col 67}{space 3} .1656078
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0001631{col 26}{space 2}  .056837{col 37}{space 1}   -0.00{col 46}{space 3}0.998{col 54}{space 4}-.1115616{col 67}{space 3} .1112353
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .1377818{col 26}{space 2} .0579843{col 37}{space 1}    2.38{col 46}{space 3}0.017{col 54}{space 4} .0241346{col 67}{space 3}  .251429
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save finaldata_imputed_FINAL, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_FINAL.dta{rm}
saved
{p_end}

{com}. 
. capture log close
{smcl}
{com}{sf}{ul off}