{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. 
. **STEP 17: TABLE 3: MED4WAY FOR foodinsecurity AS EXPOSURE, DIFFERENT PROBABILITIES OF DEMENTIA AS MEDIATORS, AND ALL-CAUSE DEATH AS OUTCOME: FULL MODEL; OVERALL AND STRATIFIED BY SEX AND BY RACE/ETHNICITY***
. 
. **COVARIATES: NonWhite AGE2012 SEX  i.education  i.totwealth_2012 marital_2012 work_st_2012 i.smoking_2012 physic_act_2012 i.srh_2012  i.bmibr_2012 cardiometcondbr_2012
. 
. use finaldata_imputed_FINAL,clear
{txt}
{com}. 
. 
. 
. capture drop lnhurd_odds
{txt}
{com}. mi passive: gen lnhurd_odds=ln((hurd_p)/(1-hurd_p))
{res}{txt}{p}
(system variable {bf:_mi_id} updated because of changed number of obs)
{p_end}
{it:m}=0:
(35,574 missing values generated)
{it:m}=1:
(35,574 missing values generated)
{it:m}=2:
(35,574 missing values generated)
{it:m}=3:
(35,574 missing values generated)
{it:m}=4:
(35,574 missing values generated)
{it:m}=5:
(35,574 missing values generated)

{com}. 
. capture drop lnexpert_odds
{txt}
{com}. mi passive: gen lnexpert_odds=ln((expert_p)/(1-expert_p))
{res}{txt}{it:m}=0:
(35,573 missing values generated)
{it:m}=1:
(35,573 missing values generated)
{it:m}=2:
(35,573 missing values generated)
{it:m}=3:
(35,573 missing values generated)
{it:m}=4:
(35,573 missing values generated)
{it:m}=5:
(35,573 missing values generated)

{com}. 
. 
. capture drop lnlasso_odds
{txt}
{com}. mi passive: gen lnlasso_odds=ln((lasso_p)/(1-lasso_p))
{res}{txt}{it:m}=0:
(36,047 missing values generated)
{it:m}=1:
(36,047 missing values generated)
{it:m}=2:
(36,047 missing values generated)
{it:m}=3:
(36,047 missing values generated)
{it:m}=4:
(36,047 missing values generated)
{it:m}=5:
(36,047 missing values generated)

{com}. 
. 
. capture drop Men
{txt}
{com}. mi passive: gen Men=1 if SEX==1 & sample_final==1
{res}{txt}{it:m}=0:
(42,180 missing values generated)
{it:m}=1:
(42,180 missing values generated)
{it:m}=2:
(42,180 missing values generated)
{it:m}=3:
(42,180 missing values generated)
{it:m}=4:
(42,180 missing values generated)
{it:m}=5:
(42,180 missing values generated)

{com}. mi passive: replace Men=0 if Men~=1 & SEX~=. & sample_final==1
{res}{txt}{it:m}=0:
(1,692 real changes made)
{it:m}=1:
(1,692 real changes made)
{it:m}=2:
(1,692 real changes made)
{it:m}=3:
(1,692 real changes made)
{it:m}=4:
(1,692 real changes made)
{it:m}=5:
(1,692 real changes made)

{com}. 
. capture drop Women
{txt}
{com}. mi passive: gen Women=1 if SEX==2 & sample_final==1
{res}{txt}{it:m}=0:
(41,690 missing values generated)
{it:m}=1:
(41,690 missing values generated)
{it:m}=2:
(41,690 missing values generated)
{it:m}=3:
(41,690 missing values generated)
{it:m}=4:
(41,690 missing values generated)
{it:m}=5:
(41,690 missing values generated)

{com}. mi passive: replace Women=0 if Women~=1 & SEX~=. & sample_final==1
{res}{txt}{it:m}=0:
(1,202 real changes made)
{it:m}=1:
(1,202 real changes made)
{it:m}=2:
(1,202 real changes made)
{it:m}=3:
(1,202 real changes made)
{it:m}=4:
(1,202 real changes made)
{it:m}=5:
(1,202 real changes made)

{com}. 
. capture drop NHW
{txt}
{com}. mi passive: gen NHW=1 if RACE_ETHN==1 & sample_final==1
{res}{txt}{it:m}=0:
(41,015 missing values generated)
{it:m}=1:
(41,015 missing values generated)
{it:m}=2:
(41,015 missing values generated)
{it:m}=3:
(41,015 missing values generated)
{it:m}=4:
(41,015 missing values generated)
{it:m}=5:
(41,015 missing values generated)

{com}. mi passive: replace NHW=0 if NHW~=1 & RACE_ETHN~=. & sample_final==1
{res}{txt}{it:m}=0:
(527 real changes made)
{it:m}=1:
(527 real changes made)
{it:m}=2:
(527 real changes made)
{it:m}=3:
(527 real changes made)
{it:m}=4:
(527 real changes made)
{it:m}=5:
(527 real changes made)

{com}. 
. capture drop NHB
{txt}
{com}. mi passive: gen NHB=1 if RACE_ETHN==2 & sample_final==1
{res}{txt}{it:m}=0:
(43,049 missing values generated)
{it:m}=1:
(43,049 missing values generated)
{it:m}=2:
(43,049 missing values generated)
{it:m}=3:
(43,049 missing values generated)
{it:m}=4:
(43,049 missing values generated)
{it:m}=5:
(43,049 missing values generated)

{com}. mi passive: replace NHB=0 if NHB~=1 & RACE_ETHN~=. & sample_final==1
{res}{txt}{it:m}=0:
(2,561 real changes made)
{it:m}=1:
(2,561 real changes made)
{it:m}=2:
(2,561 real changes made)
{it:m}=3:
(2,561 real changes made)
{it:m}=4:
(2,561 real changes made)
{it:m}=5:
(2,561 real changes made)

{com}. 
. 
. capture drop HISP
{txt}
{com}. mi passive: gen HISP=1 if RACE_ETHN==3 & sample_final==1
{res}{txt}{it:m}=0:
(43,188 missing values generated)
{it:m}=1:
(43,188 missing values generated)
{it:m}=2:
(43,188 missing values generated)
{it:m}=3:
(43,188 missing values generated)
{it:m}=4:
(43,188 missing values generated)
{it:m}=5:
(43,188 missing values generated)

{com}. mi passive: replace HISP=0 if HISP~=1 & RACE_ETHN~=. & sample_final==1 
{res}{txt}{it:m}=0:
(2,700 real changes made)
{it:m}=1:
(2,700 real changes made)
{it:m}=2:
(2,700 real changes made)
{it:m}=3:
(2,700 real changes made)
{it:m}=4:
(2,700 real changes made)
{it:m}=5:
(2,700 real changes made)

{com}. 
. 
. capture drop OTHER
{txt}
{com}. mi passive: gen OTHER=1 if RACE_ETHN==4 & sample_final==1
{res}{txt}{it:m}=0:
(43,382 missing values generated)
{it:m}=1:
(43,382 missing values generated)
{it:m}=2:
(43,382 missing values generated)
{it:m}=3:
(43,382 missing values generated)
{it:m}=4:
(43,382 missing values generated)
{it:m}=5:
(43,382 missing values generated)

{com}. mi passive: replace OTHER=0 if OTHER~=1 & RACE_ETHN~=. & sample_final==1
{res}{txt}{it:m}=0:
(2,894 real changes made)
{it:m}=1:
(2,894 real changes made)
{it:m}=2:
(2,894 real changes made)
{it:m}=3:
(2,894 real changes made)
{it:m}=4:
(2,894 real changes made)
{it:m}=5:
(2,894 real changes made)

{com}. 
. 
. capture drop NonWhite
{txt}
{com}. mi passive: gen NonWhite=0 if RACE_ETHN==1 & sample_final==1
{res}{txt}{p}
(passive variable
{res}NonWhite
{txt}unregistered because not in {it:m}=0)
{p_end}
{it:m}=0:
(41,015 missing values generated)
{it:m}=1:
(41,015 missing values generated)
{it:m}=2:
(41,015 missing values generated)
{it:m}=3:
(41,015 missing values generated)
{it:m}=4:
(41,015 missing values generated)
{it:m}=5:
(41,015 missing values generated)

{com}. mi passive: replace NonWhite=1 if RACE_ETHN!=1 & RACE_ETHN!=. & sample_final==1
{res}{txt}{it:m}=0:
(527 real changes made)
{it:m}=1:
(527 real changes made)
{it:m}=2:
(527 real changes made)
{it:m}=3:
(527 real changes made)
{it:m}=4:
(527 real changes made)
{it:m}=5:
(527 real changes made)

{com}. 
. save, replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_f14_000002.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_f14_000002.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. capture mi stset ageevent [pweight = HCNSWGTR_NT] if sample_final==1, failure(died==1) enter(AGE2012) origin(AGE2012) id(HHIDPN) scale(1)
{txt}
{com}. 
. capture drop educationg* totalwealth_2012g* marital_2012g* smoking_2012g* physic_act_2012g* srh_2012g* bmibr_2012g*  cardiometcondbr_2012g* alcohol_2012g*
{txt}
{com}. 
. tab education,generate(educationg)

  {txt}education {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     64,154       25.44       25.44
{txt}          2 {c |}{res}     12,361        4.90       30.34
{txt}          3 {c |}{res}     70,895       28.11       58.45
{txt}          4 {c |}{res}     56,429       22.37       80.82
{txt}          5 {c |}{res}     48,374       19.18      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    252,213      100.00
{txt}
{com}. 
. tab totwealth_2012, generate(totalwealth_2012g)

{txt}totwealth_2 {c |}
        012 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     41,232       33.67       33.67
{txt}          2 {c |}{res}     66,360       54.19       87.87
{txt}          3 {c |}{res}     12,366       10.10       97.97
{txt}          4 {c |}{res}      1,926        1.57       99.54
{txt}          5 {c |}{res}        564        0.46      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    122,448      100.00
{txt}
{com}. 
. tab marital_2012, generate(marital_2012g)

{txt}marital_201 {c |}
          2 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      6,003        4.90        4.90
{txt}          2 {c |}{res}     77,888       63.62       68.52
{txt}          3 {c |}{res}     16,692       13.63       82.16
{txt}          4 {c |}{res}     21,844       17.84      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    122,427      100.00
{txt}
{com}. 
. tab smoking_2012, generate(smoking_2012g)

{txt}smoking_201 {c |}
          2 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     53,691       43.93       43.93
{txt}          2 {c |}{res}     50,869       41.62       85.54
{txt}          3 {c |}{res}     17,670       14.46      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    122,230      100.00
{txt}
{com}. 
. tab physic_act_2012, generate(physic_act_2012g)

{txt}physic_act_ {c |}
       2012 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     25,940       21.19       21.19
{txt}          2 {c |}{res}     32,504       26.56       47.75
{txt}          3 {c |}{res}     63,944       52.25      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    122,388      100.00
{txt}
{com}. 
. tab alcohol_2012, generate(alcohol_2012g)

{txt}alcohol_201 {c |}
          2 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     58,568       48.41       48.41
{txt}          2 {c |}{res}     21,481       17.75       66.16
{txt}          3 {c |}{res}     26,248       21.69       87.86
{txt}          4 {c |}{res}     14,693       12.14      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    120,990      100.00
{txt}
{com}. 
. tab srh_2012, generate(srh_2012g)

   {txt}srh_2012 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     86,492       70.65       70.65
{txt}          2 {c |}{res}     35,925       29.35      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    122,417      100.00
{txt}
{com}. 
. tab bmibr_2012, generate(bmibr_2012g)

 {txt}bmibr_2012 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     35,835       29.36       29.36
{txt}          2 {c |}{res}     44,042       36.08       65.44
{txt}          3 {c |}{res}     42,178       34.56      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    122,055      100.00
{txt}
{com}.  
. tab cardiometcondbr_2012, generate(cardiometcondbr_2012g)

{txt}cardiometco {c |}
  ndbr_2012 {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}     37,506       30.63       30.63
{txt}          2 {c |}{res}     72,018       58.82       89.45
{txt}          3 {c |}{res}     12,924       10.55      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}    122,448      100.00
{txt}
{com}. 
. save, replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_f14_000002.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_f14_000002.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. ***************************TABLE 4: MODEL 2*********************************
. 
. *****************************OVERALL*******************************
. 
. capture drop zlnhurd_odds 
{txt}
{com}. capture drop zlnexpert_odds 
{txt}
{com}. capture drop zlnlasso_odds 
{txt}
{com}. capture drop zcesd_2012
{txt}
{com}. capture drop zhei2015_total_score
{txt}
{com}. foreach x of varlist  lnhurd_odds lnexpert_odds lnlasso_odds cesd_2012 hei2015_total_score {c -(}
{txt}  2{com}.         mi passive: egen z`x'=std(`x') if sample_final==1
{txt}  3{com}. {c )-}
{res}{txt}{it:m}=0:
(40,488 missing values generated)
{err}{p 0 4 2}
file {bf:{err}C:\Users\baydounm\AppData\Local\Temp\ST_f14_000002.tmp}
already exists
{p_end}
{txt}{search r(602), local:r(602);}

end of do-file

{search r(602), local:r(602);}

{com}. do "C:\Users\baydounm\AppData\Local\Temp\STDf14_000000.tmp"
{txt}
{com}. 
. ***************************TABLE 4: MODEL 2*********************************
. 
. *****************************OVERALL*******************************
. 
. capture drop zlnhurd_odds 
{txt}
{com}. capture drop zlnexpert_odds 
{txt}
{com}. capture drop zlnlasso_odds 
{txt}
{com}. capture drop zcesd_2012
{txt}
{com}. capture drop zhei2015_total_score
{txt}
{com}. foreach x of varlist  lnhurd_odds lnexpert_odds lnlasso_odds cesd_2012 hei2015_total_score {c -(}
{txt}  2{com}.         mi passive: egen z`x'=std(`x') if sample_final==1
{txt}  3{com}. {c )-}
{res}{txt}{it:m}=0:
(40,488 missing values generated)
{it:m}=1:
(40,488 missing values generated)
{it:m}=2:
(40,488 missing values generated)
{it:m}=3:
(40,488 missing values generated)
{it:m}=4:
(40,488 missing values generated)
{it:m}=5:
(40,488 missing values generated)
{res}{txt}{it:m}=0:
(40,488 missing values generated)
{it:m}=1:
(40,488 missing values generated)
{it:m}=2:
(40,488 missing values generated)
{it:m}=3:
(40,488 missing values generated)
{it:m}=4:
(40,488 missing values generated)
{it:m}=5:
(40,488 missing values generated)
{res}{txt}{it:m}=0:
(40,488 missing values generated)
{it:m}=1:
(40,488 missing values generated)
{it:m}=2:
(40,488 missing values generated)
{it:m}=3:
(40,488 missing values generated)
{it:m}=4:
(40,488 missing values generated)
{it:m}=5:
(40,488 missing values generated)
{res}{txt}{it:m}=0:
(40,570 missing values generated)
{it:m}=1:
(40,570 missing values generated)
{it:m}=2:
(40,570 missing values generated)
{it:m}=3:
(40,570 missing values generated)
{it:m}=4:
(40,570 missing values generated)
{it:m}=5:
(40,570 missing values generated)
{res}{txt}{it:m}=0:
(40,488 missing values generated)
{it:m}=1:
(40,488 missing values generated)
{it:m}=2:
(40,488 missing values generated)
{it:m}=3:
(40,488 missing values generated)
{it:m}=4:
(40,488 missing values generated)
{it:m}=5:
(40,488 missing values generated)

{com}. 
. save, replace
{txt}{p 0 4 2}
(file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_f14_000002.tmp{rm}
not found)
{p_end}
{p 0 4 2}
file {bf}
C:\Users\baydounm\AppData\Local\Temp\ST_f14_000002.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way foodinsecurity_totbr `m' AGE2012 SEX NonWhite  educationg* totwealth_2012 marital_2012g* smoking_2012g* alcohol_2012g*  physic_act_2012g* srh_2012g* bmibr_2012g*  cardiometcondbr_2012g* zcesd_2012 zhei2015_total_score if sample_final==1 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}{p}
type mismatch:
exp.exp:
transmorphic
found where
struct
expected
{p_end}
{txt}{search r(3000), local:r(3000);}

end of do-file

{search r(3000), local:r(3000);}

{com}. do "C:\Users\baydounm\AppData\Local\Temp\STDf14_000000.tmp"
{txt}
{com}. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way foodinsecurity_totbr `m' AGE2012 SEX NonWhite  educationg* totwealth_2012 marital_2012g* smoking_2012g* alcohol_2012g*  physic_act_2012g* srh_2012g* bmibr_2012g*  cardiometcondbr_2012g* zcesd_2012 zhei2015_total_score if sample_final==1 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,812
{txt}{col 49}Average RVI{col 67}= {res}    0.0009
{txt}{col 49}Largest FMI{col 67}= {res}    0.0012
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}2916603.87
{txt}{col 49}        avg{col 67}= {res}  1.44e+08
{txt}{col 49}        max{col 67}= {res}  4.63e+08

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.2695781{col 26}{space 2} .1056215{col 37}{space 1}   -2.55{col 46}{space 3}0.011{col 54}{space 4}-.4765925{col 67}{space 3}-.0625637
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.2591741{col 26}{space 2} .1073758{col 37}{space 1}   -2.41{col 46}{space 3}0.016{col 54}{space 4} -.469627{col 67}{space 3}-.0487213
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0136059{col 26}{space 2} .0056671{col 37}{space 1}   -2.40{col 46}{space 3}0.016{col 54}{space 4}-.0247132{col 67}{space 3}-.0024986
{txt}ereri_intmed {c |}{col 14}{res}{space 2} -.013969{col 26}{space 2} .0144967{col 37}{space 1}   -0.96{col 46}{space 3}0.335{col 54}{space 4}-.0423821{col 67}{space 3}  .014444
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}  .017171{col 26}{space 2} .0166644{col 37}{space 1}    1.03{col 46}{space 3}0.303{col 54}{space 4}-.0154907{col 67}{space 3} .0498326
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,812
{txt}{col 49}Average RVI{col 67}= {res}    0.0008
{txt}{col 49}Largest FMI{col 67}= {res}    0.0013
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}2265986.38
{txt}{col 49}        avg{col 67}= {res}  1.93e+08
{txt}{col 49}        max{col 67}= {res}  7.29e+08

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.2442122{col 26}{space 2} .1101098{col 37}{space 1}   -2.22{col 46}{space 3}0.027{col 54}{space 4}-.4600236{col 67}{space 3}-.0284008
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.2164587{col 26}{space 2} .1135228{col 37}{space 1}   -1.91{col 46}{space 3}0.057{col 54}{space 4}-.4389594{col 67}{space 3}  .006042
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0332531{col 26}{space 2} .0106179{col 37}{space 1}   -3.13{col 46}{space 3}0.002{col 54}{space 4}-.0540639{col 67}{space 3}-.0124424
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0122774{col 26}{space 2} .0164128{col 37}{space 1}   -0.75{col 46}{space 3}0.454{col 54}{space 4}-.0444458{col 67}{space 3}  .019891
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}  .017777{col 26}{space 2} .0231842{col 37}{space 1}    0.77{col 46}{space 3}0.443{col 54}{space 4}-.0276632{col 67}{space 3} .0632172
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,812
{txt}{col 49}Average RVI{col 67}= {res}    0.0009
{txt}{col 49}Largest FMI{col 67}= {res}    0.0011
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}3545663.74
{txt}{col 49}        avg{col 67}= {res}8154628.72
{txt}{col 49}        max{col 67}= {res}  1.58e+07

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.2652811{col 26}{space 2} .1058675{col 37}{space 1}   -2.51{col 46}{space 3}0.012{col 54}{space 4}-.4727776{col 67}{space 3}-.0577846
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.2404621{col 26}{space 2} .1083329{col 37}{space 1}   -2.22{col 46}{space 3}0.026{col 54}{space 4}-.4527907{col 67}{space 3}-.0281335
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0278741{col 26}{space 2} .0095201{col 37}{space 1}   -2.93{col 46}{space 3}0.003{col 54}{space 4}-.0465332{col 67}{space 3}-.0092149
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0061194{col 26}{space 2} .0150643{col 37}{space 1}   -0.41{col 46}{space 3}0.685{col 54}{space 4}-.0356449{col 67}{space 3} .0234062
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0091744{col 26}{space 2} .0224038{col 37}{space 1}    0.41{col 46}{space 3}0.682{col 54}{space 4}-.0347363{col 67}{space 3} .0530851
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. 
. *****************************MEN*******************************
. 
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way foodinsecurity_totbr `m' AGE2012 SEX NonWhite  educationg* totwealth_2012 marital_2012g* smoking_2012g* alcohol_2012g* physic_act_2012g* srh_2012g* bmibr_2012g*  cardiometcondbr_2012g* zcesd_2012 zhei2015_total_score if SEX==1 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,152
{txt}{col 49}Average RVI{col 67}= {res}    0.0019
{txt}{col 49}Largest FMI{col 67}= {res}    0.0036
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}315,886.88
{txt}{col 49}        avg{col 67}= {res}  1.60e+07
{txt}{col 49}        max{col 67}= {res}  4.83e+07

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.1236654{col 26}{space 2}  .192429{col 37}{space 1}   -0.64{col 46}{space 3}0.520{col 54}{space 4}-.5008205{col 67}{space 3} .2534897
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0539175{col 26}{space 2} .1944599{col 37}{space 1}   -0.28{col 46}{space 3}0.782{col 54}{space 4}-.4350532{col 67}{space 3} .3272183
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0688197{col 26}{space 2} .0223978{col 37}{space 1}   -3.07{col 46}{space 3}0.002{col 54}{space 4}-.1127188{col 67}{space 3}-.0249206
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0098052{col 26}{space 2}  .045284{col 37}{space 1}   -0.22{col 46}{space 3}0.829{col 54}{space 4}-.0985602{col 67}{space 3} .0789498
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0088769{col 26}{space 2} .0408914{col 37}{space 1}    0.22{col 46}{space 3}0.828{col 54}{space 4}-.0712687{col 67}{space 3} .0890225
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,152
{txt}{col 49}Average RVI{col 67}= {res}    0.0014
{txt}{col 49}Largest FMI{col 67}= {res}    0.0036
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}311,151.92
{txt}{col 49}        avg{col 67}= {res}8708109.05
{txt}{col 49}        max{col 67}= {res}  2.13e+07

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.1417196{col 26}{space 2} .1890923{col 37}{space 1}   -0.75{col 46}{space 3}0.454{col 54}{space 4}-.5123351{col 67}{space 3} .2288958
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.0924648{col 26}{space 2} .1912242{col 37}{space 1}   -0.48{col 46}{space 3}0.629{col 54}{space 4}-.4672589{col 67}{space 3} .2823293
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0492871{col 26}{space 2} .0186794{col 37}{space 1}   -2.64{col 46}{space 3}0.008{col 54}{space 4}-.0858982{col 67}{space 3} -.012676
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0005237{col 26}{space 2}  .035608{col 37}{space 1}   -0.01{col 46}{space 3}0.988{col 54}{space 4}-.0703141{col 67}{space 3} .0692668
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0005559{col 26}{space 2} .0380577{col 37}{space 1}    0.01{col 46}{space 3}0.988{col 54}{space 4}-.0740359{col 67}{space 3} .0751477
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,152
{txt}{col 49}Average RVI{col 67}= {res}    0.0014
{txt}{col 49}Largest FMI{col 67}= {res}    0.0036
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}314,362.09
{txt}{col 49}        avg{col 67}= {res}  1.02e+07
{txt}{col 49}        max{col 67}= {res}  3.05e+07

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.1761515{col 26}{space 2} .1789793{col 37}{space 1}   -0.98{col 46}{space 3}0.325{col 54}{space 4}-.5269455{col 67}{space 3} .1746425
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.1521312{col 26}{space 2} .1779246{col 37}{space 1}   -0.86{col 46}{space 3}0.393{col 54}{space 4}-.5008584{col 67}{space 3}  .196596
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0211543{col 26}{space 2} .0165907{col 37}{space 1}   -1.28{col 46}{space 3}0.202{col 54}{space 4}-.0536714{col 67}{space 3} .0113629
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0118217{col 26}{space 2} .0327192{col 37}{space 1}    0.36{col 46}{space 3}0.718{col 54}{space 4}-.0523068{col 67}{space 3} .0759503
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0146877{col 26}{space 2} .0400825{col 37}{space 1}   -0.37{col 46}{space 3}0.714{col 54}{space 4} -.093248{col 67}{space 3} .0638727
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. *****************************WOMEN*******************************
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way foodinsecurity_totbr `m' AGE2012 SEX NonWhite  educationg* totwealth_2012 marital_2012g* smoking_2012g* alcohol_2012g* physic_act_2012g* srh_2012g* bmibr_2012g*  cardiometcondbr_2012g* zcesd_2012 zhei2015_total_score if SEX==2 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,660
{txt}{col 49}Average RVI{col 67}= {res}    0.0002
{txt}{col 49}Largest FMI{col 67}= {res}    0.0002
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  1.42e+08
{txt}{col 49}        avg{col 67}= {res}  7.07e+08
{txt}{col 49}        max{col 67}= {res}  2.63e+09

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2} -.329122{col 26}{space 2} .1300724{col 37}{space 1}   -2.53{col 46}{space 3}0.011{col 54}{space 4}-.5840592{col 67}{space 3}-.0741848
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.3350452{col 26}{space 2} .1330621{col 37}{space 1}   -2.52{col 46}{space 3}0.012{col 54}{space 4}-.5958421{col 67}{space 3}-.0742484
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0026569{col 26}{space 2} .0054424{col 37}{space 1}   -0.49{col 46}{space 3}0.625{col 54}{space 4}-.0133238{col 67}{space 3} .0080101
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0109355{col 26}{space 2} .0132765{col 37}{space 1}   -0.82{col 46}{space 3}0.410{col 54}{space 4} -.036957{col 67}{space 3}  .015086
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0195156{col 26}{space 2} .0201126{col 37}{space 1}    0.97{col 46}{space 3}0.332{col 54}{space 4}-.0199044{col 67}{space 3} .0589356
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,660
{txt}{col 49}Average RVI{col 67}= {res}    0.0003
{txt}{col 49}Largest FMI{col 67}= {res}    0.0002
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  9.62e+07
{txt}{col 49}        avg{col 67}= {res}  2.58e+08
{txt}{col 49}        max{col 67}= {res}  7.20e+08

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.3002753{col 26}{space 2} .1384538{col 37}{space 1}   -2.17{col 46}{space 3}0.030{col 54}{space 4}-.5716398{col 67}{space 3}-.0289108
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.2904483{col 26}{space 2} .1430856{col 37}{space 1}   -2.03{col 46}{space 3}0.042{col 54}{space 4}-.5708909{col 67}{space 3}-.0100056
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0206588{col 26}{space 2} .0131666{col 37}{space 1}   -1.57{col 46}{space 3}0.117{col 54}{space 4}-.0464649{col 67}{space 3} .0051472
{txt}ereri_intmed {c |}{col 14}{res}{space 2} -.013881{col 26}{space 2} .0171942{col 37}{space 1}   -0.81{col 46}{space 3}0.419{col 54}{space 4}-.0475811{col 67}{space 3}  .019819
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0247128{col 26}{space 2} .0288609{col 37}{space 1}    0.86{col 46}{space 3}0.392{col 54}{space 4}-.0318535{col 67}{space 3}  .081279
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     1,660
{txt}{col 49}Average RVI{col 67}= {res}    0.0004
{txt}{col 49}Largest FMI{col 67}= {res}    0.0002
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}  6.74e+07
{txt}{col 49}        avg{col 67}= {res}  2.86e+08
{txt}{col 49}        max{col 67}= {res}  7.77e+08

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.3175377{col 26}{space 2} .1337604{col 37}{space 1}   -2.37{col 46}{space 3}0.018{col 54}{space 4}-.5797031{col 67}{space 3}-.0553722
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.2992644{col 26}{space 2} .1379949{col 37}{space 1}   -2.17{col 46}{space 3}0.030{col 54}{space 4}-.5697294{col 67}{space 3}-.0287994
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0267566{col 26}{space 2} .0148739{col 37}{space 1}   -1.80{col 46}{space 3}0.072{col 54}{space 4}-.0559088{col 67}{space 3} .0023957
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0112879{col 26}{space 2} .0161148{col 37}{space 1}   -0.70{col 46}{space 3}0.484{col 54}{space 4}-.0428723{col 67}{space 3} .0202965
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0197712{col 26}{space 2} .0270137{col 37}{space 1}    0.73{col 46}{space 3}0.464{col 54}{space 4}-.0331747{col 67}{space 3} .0727171
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. ***************************NHW*****************************************
. 
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way foodinsecurity_totbr `m' AGE2012 SEX NonWhite  educationg* totwealth_2012 marital_2012g* smoking_2012g* alcohol_2012g* physic_act_2012g* srh_2012g* bmibr_2012g*  cardiometcondbr_2012g* zcesd_2012 zhei2015_total_score if NonWhite==0 , a0(0) a1(1) m(0) yreg(cox) mreg(linear)   
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,309
{txt}{col 49}Average RVI{col 67}= {res}    0.0005
{txt}{col 49}Largest FMI{col 67}= {res}    0.0010
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}4199026.28
{txt}{col 49}        avg{col 67}= {res}  2.55e+08
{txt}{col 49}        max{col 67}= {res}  7.63e+08

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.2910425{col 26}{space 2} .1258658{col 37}{space 1}   -2.31{col 46}{space 3}0.021{col 54}{space 4}-.5377351{col 67}{space 3}-.0443499
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} -.295405{col 26}{space 2} .1219006{col 37}{space 1}   -2.42{col 46}{space 3}0.015{col 54}{space 4}-.5343259{col 67}{space 3}-.0564841
{txt}ereri_intref {c |}{col 14}{res}{space 2} .0048204{col 26}{space 2} .0148505{col 37}{space 1}    0.32{col 46}{space 3}0.745{col 54}{space 4}-.0242861{col 67}{space 3}  .033927
{txt}ereri_intmed {c |}{col 14}{res}{space 2} -.006629{col 26}{space 2} .0219764{col 37}{space 1}   -0.30{col 46}{space 3}0.763{col 54}{space 4} -.049702{col 67}{space 3}  .036444
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0061711{col 26}{space 2} .0203536{col 37}{space 1}    0.30{col 46}{space 3}0.762{col 54}{space 4}-.0337213{col 67}{space 3} .0460635
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,309
{txt}{col 49}Average RVI{col 67}= {res}    0.0005
{txt}{col 49}Largest FMI{col 67}= {res}    0.0010
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}3744784.80
{txt}{col 49}        avg{col 67}= {res}  5.68e+07
{txt}{col 49}        max{col 67}= {res}  1.74e+08

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.2565085{col 26}{space 2}  .131851{col 37}{space 1}   -1.95{col 46}{space 3}0.052{col 54}{space 4}-.5149317{col 67}{space 3} .0019148
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.2457209{col 26}{space 2} .1317116{col 37}{space 1}   -1.87{col 46}{space 3}0.062{col 54}{space 4} -.503871{col 67}{space 3} .0124291
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0125106{col 26}{space 2} .0118076{col 37}{space 1}   -1.06{col 46}{space 3}0.289{col 54}{space 4}-.0356531{col 67}{space 3} .0106318
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0156249{col 26}{space 2} .0254425{col 37}{space 1}   -0.61{col 46}{space 3}0.539{col 54}{space 4}-.0654913{col 67}{space 3} .0342415
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}  .017348{col 26}{space 2} .0278624{col 37}{space 1}    0.62{col 46}{space 3}0.534{col 54}{space 4}-.0372614{col 67}{space 3} .0719574
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}     2,309
{txt}{col 49}Average RVI{col 67}= {res}    0.0005
{txt}{col 49}Largest FMI{col 67}= {res}    0.0009
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}4626160.82
{txt}{col 49}        avg{col 67}= {res}  2.31e+07
{txt}{col 49}        max{col 67}= {res}  5.16e+07

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.2846712{col 26}{space 2} .1262031{col 37}{space 1}   -2.26{col 46}{space 3}0.024{col 54}{space 4}-.5320248{col 67}{space 3}-.0373176
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.2703605{col 26}{space 2} .1255481{col 37}{space 1}   -2.15{col 46}{space 3}0.031{col 54}{space 4}-.5164303{col 67}{space 3}-.0242907
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0138972{col 26}{space 2} .0101146{col 37}{space 1}   -1.37{col 46}{space 3}0.169{col 54}{space 4}-.0337215{col 67}{space 3} .0059271
{txt}ereri_intmed {c |}{col 14}{res}{space 2} .0022728{col 26}{space 2} .0230921{col 37}{space 1}    0.10{col 46}{space 3}0.922{col 54}{space 4}-.0429869{col 67}{space 3} .0475325
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2}-.0026863{col 26}{space 2} .0272959{col 37}{space 1}   -0.10{col 46}{space 3}0.922{col 54}{space 4}-.0561853{col 67}{space 3} .0508126
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. 
. 
. ***************************Non-White*************************************
. 
. foreach m of varlist zlnhurd_odds zlnexpert_odds zlnlasso_odds {c -(}
{txt}  2{com}. mi estimate, cmdok esampvaryok: med4way foodinsecurity_totbr `m' AGE2012 SEX NonWhite  educationg* totwealth_2012 marital_2012g* smoking_2012g* alcohol_2012g* physic_act_2012g* srh_2012g* bmibr_2012g*  cardiometcondbr_2012g* zcesd_2012 zhei2015_total_score if NonWhite==1 , a0(0) a1(1) m(0) yreg(cox) mreg(linear) 
{txt}  3{com}. {c )-}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}       503
{txt}{col 49}Average RVI{col 67}= {res}    0.0008
{txt}{col 49}Largest FMI{col 67}= {res}    0.0010
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}4341890.93
{txt}{col 49}        avg{col 67}= {res}  2.54e+07
{txt}{col 49}        max{col 67}= {res}  7.61e+07

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.2121221{col 26}{space 2} .2004056{col 37}{space 1}   -1.06{col 46}{space 3}0.290{col 54}{space 4}  -.60491{col 67}{space 3} .1806657
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.1955048{col 26}{space 2} .2128788{col 37}{space 1}   -0.92{col 46}{space 3}0.358{col 54}{space 4}-.6127398{col 67}{space 3} .2217301
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0442586{col 26}{space 2} .0763033{col 37}{space 1}   -0.58{col 46}{space 3}0.562{col 54}{space 4}-.1938104{col 67}{space 3} .1052931
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0133132{col 26}{space 2} .0233942{col 37}{space 1}   -0.57{col 46}{space 3}0.569{col 54}{space 4} -.059165{col 67}{space 3} .0325386
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0409545{col 26}{space 2}  .042261{col 37}{space 1}    0.97{col 46}{space 3}0.333{col 54}{space 4}-.0418755{col 67}{space 3} .1237845
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}       503
{txt}{col 49}Average RVI{col 67}= {res}    0.0005
{txt}{col 49}Largest FMI{col 67}= {res}    0.0010
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}3887413.82
{txt}{col 49}        avg{col 67}= {res}  3.23e+07
{txt}{col 49}        max{col 67}= {res}  1.04e+08

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.2213902{col 26}{space 2} .1980725{col 37}{space 1}   -1.12{col 46}{space 3}0.264{col 54}{space 4}-.6096052{col 67}{space 3} .1668247
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2} -.188808{col 26}{space 2} .2062725{col 37}{space 1}   -0.92{col 46}{space 3}0.360{col 54}{space 4}-.5930949{col 67}{space 3} .2154788
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0386859{col 26}{space 2} .0916132{col 37}{space 1}   -0.42{col 46}{space 3}0.673{col 54}{space 4}-.2182445{col 67}{space 3} .1408726
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0017686{col 26}{space 2} .0115383{col 37}{space 1}   -0.15{col 46}{space 3}0.878{col 54}{space 4}-.0243833{col 67}{space 3} .0208461
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0078723{col 26}{space 2} .0494591{col 37}{space 1}    0.16{col 46}{space 3}0.874{col 54}{space 4}-.0890657{col 67}{space 3} .1048104
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}{err}Warning: this analysis assumes a rare outcome.
Warning: fixed values for the covariates AGE2012 SEX NonWhite educationg1 educationg2 educationg3 educationg4 educationg5 totwealth_2012 marital_2012g1 marital_2012g2 marital_2012g3 marital_2012g4 smoking_2012g1 smoking_2012g2 smoking_2012g3 alcohol_2012g1 alcohol_2012g2 alcohol_2012g3 alcohol_2012g4 physic_act_2012g1 physic_act_2012g2 physic_act_2012g3 srh_2012g1 srh_2012g2 bmibr_2012g1 bmibr_2012g2 bmibr_2012g3 cardiometcondbr_2012g1 cardiometcondbr_2012g2 cardiometcondbr_2012g3 zcesd_2012 zhei2015_total_score were not provided. All covariates are fixed at their respective mean.
{res}
{txt}Multiple-imputation estimates{col 49}Imputations{col 67}= {res}         5
{txt}{col 49}Number of obs{col 67}= {res}       503
{txt}{col 49}Average RVI{col 67}= {res}    0.0018
{txt}{col 49}Largest FMI{col 67}= {res}    0.0017
{txt}DF adjustment:{ralign 15: {res:Large sample}}{col 49}DF:     min{col 67}= {res}1339029.25
{txt}{col 49}        avg{col 67}= {res}  1.21e+07
{txt}{col 49}        max{col 67}= {res}  4.22e+07

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |} Coefficient{col 26}  Std. err.{col 38}      t{col 46}   P>|t|{col 54}     [95% con{col 67}f. interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}tereri {c |}{col 14}{res}{space 2}-.2270795{col 26}{space 2} .1980673{col 37}{space 1}   -1.15{col 46}{space 3}0.252{col 54}{space 4}-.6152844{col 67}{space 3} .1611253
{txt}{space 3}ereri_cde {c |}{col 14}{res}{space 2}-.1887381{col 26}{space 2} .2047714{col 37}{space 1}   -0.92{col 46}{space 3}0.357{col 54}{space 4}-.5900828{col 67}{space 3} .2126067
{txt}ereri_intref {c |}{col 14}{res}{space 2}-.0530081{col 26}{space 2}  .066591{col 37}{space 1}   -0.80{col 46}{space 3}0.426{col 54}{space 4}-.1835241{col 67}{space 3} .0775079
{txt}ereri_intmed {c |}{col 14}{res}{space 2}-.0082921{col 26}{space 2}  .018184{col 37}{space 1}   -0.46{col 46}{space 3}0.648{col 54}{space 4}-.0439321{col 67}{space 3}  .027348
{txt}{space 3}ereri_pie {c |}{col 14}{res}{space 2} .0229587{col 26}{space 2} .0443849{col 37}{space 1}    0.52{col 46}{space 3}0.605{col 54}{space 4} -.064034{col 67}{space 3} .1099515
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. 
. save finaldata_imputed_FINAL, replace
{txt}{p 0 4 2}
file {bf}
finaldata_imputed_FINAL.dta{rm}
saved
{p_end}

{com}. 
. 
. 
. 
. capture log close
{smcl}
{com}{sf}{ul off}